Revit 2027 API
PrintRange Enumeration
An enumerated type listing all Print Range types of Print.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PrintRange
Public Enumeration PrintRange
public enum class PrintRange
type PrintRange
Members
Member name | Value | Description
Current | 0 | A range that represents just the currently active view.
Select | 2 | A range that represents a list of selected views and sheets.
Visible | 1 | Visible portion of current window.
See Also
Reference
Autodesk.Revit.DB Namespace